// Задайте строку, содержащую латинские буквы
// в обоих регистрах. Сформируйте строку, в которой все
// заглавные буквы заменены на строчные. 


string str = "aBEDXADcD1ef!-";
Console.WriteLine(str.ToLower());